MicrochipTech/dspic33a-high-speed-adc-example/cli.c
/*
 * cli.c
 *
 * Console for the ADC/DMA example: the UART, a trace channel for the
 * start-up sequence, and the command parser from
 * https://github.com/zabooh/cmd_parser (Apache 2.0). This file owns the
 * transport and the commands; the parser itself knows no hardware.
 *
 * Transport on the EV74H48A
 *   UART2 on the MCP2221A USB-UART channel: U2TX -> RH1 (RP114, DIM pin
 *   P98 "UART_USB_TX"), U2RX <- RD1 (RP50, DIM pin P96
 *   "UART_USB_RX"), 115200 8N1 (pins in board.h). The MCP2221A implements standard USB CDC
 *   and shows up on the PC as its own COM port (user guide DS70005562D
 *   2.1.1). The PPS code is the one Microchip's own example uses on
 *   this board (U2TX = 21, Table "Output Selection for Remappable
 *   Pins", p613). The board's other USB-UART channel (the PKOB4's) is
 *   not used by this console.
 *
 * Two phases
 *   console_early_init() runs before the clocks are touched, on the
 *   8 MHz FRC, so that every step of clock_init() and a failure inside
 *   it can be reported. console_puts() is the blocking trace output used
 *   from then on. cli_init() runs after the clocks: it moves the baud
 *   generator to the 100 MHz peripheral clock, starts the parser, prints
 *   the banner and enables the receive interrupt.
 *
 * The parser as its own thread
 *   Received bytes are handled in the UART2 receive interrupt, which
 *   runs at priority 1. A command executes inside that interrupt,
 *   including its output; the DMA interrupt (priority 4) preempts it, so
 *   the measurement keeps running while a long reply drains. main() is
 *   the one that waits during a long reply - it only processes buffer
 *   halves and blinks, and it reports that with proc_missed if it
 *   matters. Ctrl+C aborts a long reply: the yield hook, which runs
 *   while the transmit buffer is full, peeks at the receiver for it.
 *
 * Commands
 *   help                       list of commands (built into the parser)
 *   version                    build, board, ADC core and input
 *   status                     run state, counters, input, self-test
 *   regs                       dump of the clock, ADC, DMA and UART registers
 *   start | stop               burst stream on/off
 *   samc <0..31>               sample time, (2*SAMC + 0.5) TAD
 *   period <n>                 sample period in the active pacing's unit (TAD or 10 ns ticks)
 *   pacing <3|32|2>            ADC repeat timer | SCCP1 timer | back-to-back
 *   input <0..15>              PINSEL of the ADC core (6 = internal ref)
 *   selftest                   sample the internal reference, judge it
 *   stats                      min/max/mean of the completed half
 *   dump [count] [offset]      samples of the completed half
 *   clear                      zero the error counters
 *   led on|off|auto            LED0
 *   sweep [halves]             overrun vs sample rate, 1.25..40 MSPS, one table
 *   reset                      software reset
 *
 * Every command ends its output with a newline and calls
 * cmd_parser_fail() on a usage or argument error, so a script sees NAK
 * (see cmd_parser.h, "Prompt as a protocol element").
 */

#include <xc.h>
#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdlib.h>
#include <string.h>
#include "board.h"
#include "timebase.h"
#include "clock.h"
#include "capture.h"
#include "adc.h"
#include "dac.h"
#include "dactest.h"
#include "led.h"
#include "diag.h"
#include "console.h"
#include "sim.h"
#include "cmd_parser.h"

/* ------------------------------------------------------------------ *
 * UART2 transport
 * ------------------------------------------------------------------ */

/* Baud rate generator, fractional mode (CLKMOD = 1): BRG = F_clk / baud,
 * no -1 (the value MCC generates for this board is 868 at 100 MHz).
 * F_clk is the Standard Speed Peripheral Clock = CPU clock / 2:
 *   after reset, on the 8 MHz FRC:        4 MHz  -> BRG 35, 114 286 baud
 *   after clock_init(), PLL2 at 200 MHz: 100 MHz -> BRG 868, 115 207 baud
 * Both are within 1 % of 115 200. */
#define UART_BRG_FRC      35u
#ifdef __MPLAB_DEBUGGER_SIMULATOR
#define UART_BRG_PLL      UART_BRG_FRC   /* the simulator never leaves the 8 MHz FRC */
#else
#define UART_BRG_PLL      868u
#endif

#define UART_RX_PRIORITY  1u      /* below the DMA interrupt (4)        */

static void uart2_setup(uint32_t brg)
{
    U2CON = 0u;                       /* off while reconfiguring        */
    U2CONbits.CLKMOD = 1u;            /* fractional baud generator      */
    U2CONbits.CLKSEL = 0u;            /* standard speed peripheral clock*/
    U2CONbits.MODE   = 0u;            /* 8-bit, no parity               */
    U2CONbits.STP    = 0u;            /* one stop bit                   */
    U2BRG = brg;
    U2STAT = 0u;                      /* RXWM = 0: IRQ on one byte      */
    U2CONbits.ON   = 1u;
    U2CONbits.TXEN = 1u;
    U2CONbits.RXEN = 1u;
}

void console_early_init(void)
{
    /* Pins: TX output, RX input (board.h). Peripheral pin select needs
     * IOLOCK cleared. */
    CONSOLE_TX_TRIS  = 0u;
    CONSOLE_RX_TRIS  = 1u;
    RPCONbits.IOLOCK = 0u;
    CONSOLE_RX_RPINR = CONSOLE_RX_RP;
    CONSOLE_TX_RPOR  = CONSOLE_TX_FN;
    RPCONbits.IOLOCK = 1u;

    uart2_setup(UART_BRG_FRC);
    console_puts("\r\n[boot] uart up on FRC, 115200 8N1\r\n");
}

/* How long to wait for the transmitter, in polling iterations. One
 * character takes 87 us at 115200 baud; on the 8 MHz FRC that is a few
 * hundred cycles, at 200 MHz about 17 000. 200 000 is far more than
 * either and still finite - which is the whole point: console_puts() is
 * called from _DefaultInterrupt() to report a trap, and if the UART is
 * not actually transmitting (wrong baud divider, ON bit cleared, clock
 * gone) an unbounded wait would silently swallow the one message that
 * explains the fault. Better a garbled line than none. */
#define TX_WAIT_LIMIT     200000u

/* Blocking output, usable at any time after console_early_init(): from
 * main(), from fail(), from _DefaultInterrupt() and from the receive
 * interrupt (the parser's own output goes through console_write()
 * below instead). Never blocks forever - see TX_WAIT_LIMIT. */
void console_puts(const char *s)
{
    while (*s) {
        uint32_t n = TX_WAIT_LIMIT;
        while (U2STATbits.TXBF && (--n != 0u)) { }
        U2TXB = (uint8_t)*s++;
    }
}

static void console_drain(void)
{
#ifdef __MPLAB_DEBUGGER_SIMULATOR
    return;     /* the simulator never sets TXMTIF: the bounded wait below
                 * would take about a minute per call and look like a hang */
#endif
    uint32_t n = TX_WAIT_LIMIT;
    while (!U2STATbits.TXMTIF && (--n != 0u)) { }   /* shift reg empty too */
}

