MicrochipTech/dspic33a-high-speed-adc-example/cli.c
static void put_kv(const char *key, uint32_t v)
{
    char num[16];
    char *p = u32_to_str(num, v);
    copy_str(p, "\r\n");
    cmd_parser_write(key);
    cmd_parser_write(": ");
    cmd_parser_write(num);
}

static void put_line(const char *s)
{
    cmd_parser_write(s);
    cmd_parser_write("\r\n");
}

/* One status line, blocking, for the periodic trace from main(). */
void console_status_line(void)
{
    char line[256];                       /* 236 used with every field at max */
    char *p = copy_str(line, "[stat] blocks=");
    p = u32_to_str(p, blocks_done);
    p = copy_str(p, " overrun=");  p = u32_to_str(p, dma_overrun);
    p = copy_str(p, " late=");     p = u32_to_str(p, late_service);
    p = copy_str(p, " missed=");   p = u32_to_str(p, proc_missed);
    p = copy_str(p, " addr_err="); p = u32_to_str(p, dma_addr_err);
    p = copy_str(p, " bus_err=");  p = u32_to_str(p, dma_bus_err);
    p = copy_str(p, " last=");     p = u32_to_str(p, last_sample);
    p = copy_str(p, " input=");    p = u32_to_str(p, capture_pinsel());
    p = copy_str(p, " samc=");     p = u32_to_str(p, capture_samc());
    p = copy_str(p, " pace=");     p = u32_to_str(p, capture_pacing());
    p = copy_str(p, " per=");      p = u32_to_str(p, capture_period());
    p = copy_str(p, " run=");      p = u32_to_str(p, capture_running() ? 1u : 0u);
    p = copy_str(p, " pwr=");      p = u32_to_str(p, capture_powered() ? 1u : 0u);
    /* Does the ADC's channel-done event reach the CPU side at all? It is
     * the DMA trigger and stays masked (IEC6 = 0), so this flag being 1
     * while the DMA runs says the event is visible to the CPU - the
     * precondition for the vector-201 trap TROUBLESHOOTING 2.0b describes. */
    p = copy_str(p, " core=");     p = u32_to_str(p, adc_core());
    p = copy_str(p, " adif=");     p = u32_to_str(p, adc_ch0_flag() ? 1u : 0u);
    /* Receive diagnostics, see rx_count above. */
    p = copy_str(p, " rx=");       p = u32_to_str(p, rx_count);
    p = copy_str(p, " last=");     p = u32_to_hex(p, rx_last);
    p = copy_str(p, " cr=");       p = u32_to_str(p, rx_cr);
    p = copy_str(p, " lf=");       p = u32_to_str(p, rx_lf);
    copy_str(p, "\r\n");
    console_puts(line);
}

/* Decimal argument in [lo, hi]; false (and NAK) otherwise. */
static bool arg_u32(const char *s, uint32_t lo, uint32_t hi, uint32_t *out)
{
    char *end;
    unsigned long v;
    if (*s == '\0') { return false; }
    v = strtoul(s, &end, 0);
    if ((*end != '\0') || (v < lo) || (v > hi)) { return false; }
    *out = (uint32_t)v;
    return true;
}

static void usage(const char *text)
{
    cmd_parser_write("usage: ");
    put_line(text);
    cmd_parser_fail();
}

/* ------------------------------------------------------------------ *
 * Commands
 * ------------------------------------------------------------------ */
static void cmd_version_fn(int argc, char **argv)
{
    (void)argc; (void)argv;
    diag_report_build();          /* same block as at boot ([build] ...) */
}
CMD_DEFINE(version, "version", cmd_version_fn, "version - build id, git revision, board, configuration");

static void cmd_status_fn(int argc, char **argv)
{
    (void)argc; (void)argv;
    put_kv("running", capture_running() ? 1u : 0u);
    put_kv("powered", capture_powered() ? 1u : 0u);
    put_kv("blocks", blocks_done);
    put_kv("overrun", dma_overrun);
    put_kv("late", late_service);
    put_kv("missed", proc_missed);
    put_kv("addr_err", dma_addr_err);
    put_kv("bus_err", dma_bus_err);
    put_kv("input", capture_pinsel());
    put_kv("samc", capture_samc());
    put_kv("pacing", capture_pacing());
    put_kv("period", capture_period());
    put_kv("last", last_sample);
    put_kv("selftest_mean", selftest_mean);
    put_kv("fail_code", fail_code);
    put_kv("rx_bytes", rx_count);
    put_kv("rx_last", rx_last);
    put_kv("rx_cr", rx_cr);
    put_kv("rx_lf", rx_lf);
}
CMD_DEFINE(status, "status", cmd_status_fn, "status - run state and counters");

static void cmd_regs_fn(int argc, char **argv)
{
    (void)argc; (void)argv;
    regs_dump();
}
CMD_DEFINE(regs, "regs", cmd_regs_fn, "regs - clock, ADC, DMA and UART registers");

static void cmd_start_fn(int argc, char **argv)
{
    (void)argc; (void)argv;
    capture_start();
    put_kv("running", 1u);
}
CMD_DEFINE(start, "start", cmd_start_fn, "start - start the burst stream");

static void cmd_stop_fn(int argc, char **argv)
{
    (void)argc; (void)argv;
    capture_stop();
    put_kv("running", 0u);
}
CMD_DEFINE(stop, "stop", cmd_stop_fn, "stop - stop after the current buffer");

static void cmd_samc_fn(int argc, char **argv)
{
    uint32_t v;
    if ((argc != 2) || !arg_u32(argv[1], 0u, 31u, &v)) {
        usage("samc <0..31>  (sample time (2*SAMC+0.5) TAD; the rate is set by 'period')");
        return;
    }
    (void)capture_set_input(capture_pinsel(), (uint8_t)v);
    put_kv("samc", v);
}
CMD_DEFINE(samc, "samc", cmd_samc_fn, "samc <0..31> - sample time in TAD steps");

static void cmd_input_fn(int argc, char **argv)
{
    uint32_t v;
    if ((argc != 2) || !arg_u32(argv[1], 0u, 15u, &v)) {
        usage("input <0..15>  (PINSEL of the ADC core, 6 = internal 15/16 VDD)");
        return;
    }
    (void)capture_set_input((uint8_t)v, capture_samc());
    put_kv("input", v);
}
CMD_DEFINE(input, "input", cmd_input_fn, "input <0..15> - analog input (PINSEL)");

static void cmd_core_fn(int argc, char **argv)
{
    uint32_t core, pinsel = ADC_PINSEL;
    if ((argc < 2) || (argc > 3) || !arg_u32(argv[1], 1u, 5u, &core) ||
        ((argc == 3) && !arg_u32(argv[2], 0u, 15u, &pinsel))) {
        usage("core <1..5> [pinsel]  (switch the ADC core; 5 3 = DAC2's pin RA8)");
        return;
    }
    if (!capture_select_core((uint8_t)core, (uint8_t)pinsel, capture_samc())) { cmd_parser_fail(); return; }
    put_kv("core", core);
    put_kv("input", pinsel);
}
CMD_DEFINE(core, "core", cmd_core_fn, "core <1..5> [pinsel] - switch the ADC core");

static void cmd_dac_fn(int argc, char **argv)
{
    if ((argc == 2) && (argv[1][0] == 'o') && (argv[1][1] == 'f')) {
        dac2_off();
        put_line("dac: off");
        return;
    }
    uint32_t slp = 8u;
    if ((argc < 2) || (argc > 3) || (argv[1][0] != 'o') || (argv[1][1] != 'n') ||
        ((argc == 3) && !arg_u32(argv[2], 1u, 255u, &slp))) {
        usage("dac <on [slpdat]|off>  (DAC2 triangle 0x100..0xF00 on RA8; slpdat = counts per DAC clock, 8 = 22 kHz)");
        return;
    }
    if (!dac2_triangle_start(0x100u, 0xF00u, (uint16_t)slp)) { put_line("dac: CLKGEN7 did not come up"); cmd_parser_fail(); return; }
    put_kv("dac slpdat", slp);
    put_kv("dac period ns", dac2_period_ns());
}
CMD_DEFINE(dac, "dac", cmd_dac_fn, "dac <on [slpdat]|off> - DAC2 triangle on RA8");

static void cmd_dactest_fn(int argc, char **argv)
{
    uint32_t halves = 64u;
    if ((argc > 2) || ((argc == 2) && !arg_u32(argv[1], 1u, 10000u, &halves))) {
        usage("dactest [halves]  (capture and judge the DAC2 triangle, default 64 halves)");
        return;
    }
    if (dactest_run(halves) != 0u) { cmd_parser_fail(); }
}
CMD_DEFINE(dactest, "dactest", cmd_dactest_fn, "dactest [halves] - judge the DAC2 triangle through the chain");

static void cmd_selftest_fn(int argc, char **argv)
{
    uint32_t mean = 0;
    (void)argc; (void)argv;
    const uint32_t rc = capture_selftest(&mean);
    put_kv("selftest_mean", mean);
    if (rc == 0u)      { put_line("selftest: ok (3648..4032)"); }
    else if (rc == 6u) { put_line("selftest: no data - is the stream running?"); }
    else if (rc == 7u) { put_line("selftest: mean outside 3648..4032"); }
    else               { put_line("selftest: DMA channel disabled (address fault?)"); }
    if (rc != 0u) { cmd_parser_fail(); }
}
CMD_DEFINE(selftest, "selftest", cmd_selftest_fn, "selftest - sample the internal reference");

/* min/max/mean/pp of the completed half - shared by "stats" and the
 * periodic [half] line. */
static void half_stats(uint32_t *mn, uint32_t *mx, uint32_t *mean)
{
    const volatile uint16_t *b = capture_completed_half();
    uint32_t lo = 0xFFFFu, hi = 0u, acc = 0u;
    for (uint32_t i = 0; i < SAMPLES_PER_HALF; i++) {
        const uint16_t v = b[i];
        if (v < lo) { lo = v; }
        if (v > hi) { hi = v; }
        acc += v;
    }
    *mn = lo; *mx = hi; *mean = acc / SAMPLES_PER_HALF;
}

void console_half_stats(void)
{
    char line[96];
    uint32_t mn, mx, mean;
    half_stats(&mn, &mx, &mean);
    char *p = copy_str(line, "[half] n=");
    p = u32_to_str(p, ready_half);
    p = copy_str(p, " min=");  p = u32_to_str(p, mn);
    p = copy_str(p, " max=");  p = u32_to_str(p, mx);
    p = copy_str(p, " mean="); p = u32_to_str(p, mean);
    p = copy_str(p, " pp=");   p = u32_to_str(p, mx - mn);
    copy_str(p, "\r\n");
    console_puts(line);
}

static void cmd_stats_fn(int argc, char **argv)
{
    uint32_t mn, mx, mean;
    (void)argc; (void)argv;
    half_stats(&mn, &mx, &mean);
    put_kv("half", ready_half);
    put_kv("min", mn);
    put_kv("max", mx);
    put_kv("mean", mean);
    put_kv("pp", mx - mn);
}
CMD_DEFINE(stats, "stats", cmd_stats_fn, "stats - min/max/mean of the completed half");

static void cmd_dump_fn(int argc, char **argv)
{
    uint32_t count = 64u, offset = 0u;
    if ((argc > 3) ||
        ((argc >= 2) && !arg_u32(argv[1], 1u, SAMPLES_PER_HALF, &count)) ||
        ((argc == 3) && !arg_u32(argv[2], 0u, SAMPLES_PER_HALF - 1u, &offset))) {
        usage("dump [count 1..1024] [offset 0..1023]");
        return;
    }
    if (offset + count > SAMPLES_PER_HALF) {
        count = SAMPLES_PER_HALF - offset;
    }
    const volatile uint16_t *b = capture_completed_half();
    char line[80];
    for (uint32_t i = 0; i < count; i += 8u) {
        char *p = line;
        /* "nnnn:" index, then up to eight values */
        uint32_t idx = offset + i;
        for (int d = 3; d >= 0; d--) { p[d] = (char)('0' + idx % 10u); idx /= 10u; }
        p += 4; *p++ = ':';
        for (uint32_t k = 0; (k < 8u) && (i + k < count); k++) {
            *p++ = ' ';
            p = u32_to_str(p, b[offset + i + k]);
        }
        copy_str(p, "\r\n");
        cmd_parser_write(line);
        if (cmd_parser_aborted()) { return; }
    }
}
CMD_DEFINE(dump, "dump", cmd_dump_fn, "dump [count] [offset] - samples of the completed half");

static void cmd_clear_fn(int argc, char **argv)
{
    (void)argc; (void)argv;
    counters_clear();
    put_line("counters cleared");
}
CMD_DEFINE(clear, "clear", cmd_clear_fn, "clear - zero the error counters");

static void cmd_led_fn(int argc, char **argv)
{
    if (argc == 2) {
        if (strcmp(argv[1], "on") == 0)   { led_mode(1u); put_line("led: on");   return; }
        if (strcmp(argv[1], "off") == 0)  { led_mode(0u); put_line("led: off");  return; }
        if (strcmp(argv[1], "auto") == 0) { led_mode(2u); put_line("led: auto"); return; }
    }
    usage("led on|off|auto");
}
CMD_DEFINE(led, "led", cmd_led_fn, "led on|off|auto - LED0");

/* ------------------------------------------------------------------ *
 * sweep - the rate measurement, automated
 *
 * For each repeat-timer period from RPTCNT 63 (1.27 MSPS) down to 2
 * (40 MSPS): stop the stream, wait for the burst to end, set the period,
 * clear the counters, run `halves` buffer halves, read the counters.
 * (The first version swept SAMC, the sample time, and the board showed
 * that with the back-to-back trigger the delivered rate did not follow
 * it; the ADC's repeat timer is what sets the rate now, see adc.c.)
 * Three times per rate, with the CPU doing something different while
 * the DMA runs, because the first board run could not tell whether the
 * overruns come from the DMA bus itself or from the CPU competing for
 * it (DS70005591D 13.4.4, one shared DMA data bus):
 *
 *   idle     the CPU polls blocks_done, a RAM variable, nothing else
 *   process  the CPU runs capture_service(), i.e. process_buffer() on
 *            every completed half - what the application would do
 *   sfr      the CPU reads U2STAT in a tight loop - the worst case, a
 *            CPU that hammers the peripheral bus (the console does this
 *            while it prints)
 *
 * One line per rate. overrun must be 0 for a rate to be usable. The
 * whole sweep runs inside the receive interrupt, like every command;
 * the DMA interrupt preempts it, the main loop is starved meanwhile
 * (counters are cleared afterwards, so that does not show up). The
 * previous sample time and run state are restored at the end.
 * ------------------------------------------------------------------ */
#define SWEEP_HALVES_DEFAULT  2000u          /* 2 M samples per point   */
#define SWEEP_WAIT_LIMIT      400000000u     /* loop iterations, ~10 s  */

/* The MEASURED rate comes from timebase.c (Timer1 at 12.5 MHz). The rate
 * the first board sweep printed was the nominal 40/(SAMC+1); the counters
 * said it was not what the ADC did (equal overruns at every "rate",
 * halves missed at 1.25 MSPS), so from then on the sweep measures. */

enum sweep_load { SWEEP_IDLE = 0, SWEEP_PROCESS = 1, SWEEP_SFR = 2 };

/* Run `halves` halves at `samc` with the CPU under `load` meanwhile.
 * *ticks receives the Timer1 ticks the halves took. Returns false if
 * the stream stopped or never delivered. */
static bool sweep_point(uint32_t period, uint32_t halves, enum sweep_load load, uint32_t *ticks)
{
    uint32_t n = SWEEP_WAIT_LIMIT;
    capture_stop();
    while (capture_burst_active() && (--n != 0u)) { SIM_DMA_TICK(); }
    if (n == 0u) { return false; }
    if (period != 0u) { (void)capture_set_period(period); }   /* idle: applied now */
    counters_clear();
    const uint32_t target = blocks_done + halves;
    const uint32_t t0 = timebase_ticks();
    capture_start();
    n = SWEEP_WAIT_LIMIT;
    while (blocks_done < target) {
        SIM_DMA_TICK();
        if (load == SWEEP_PROCESS)      { (void)capture_service(); }
        else if (load == SWEEP_SFR)     { (void)U2STAT; }
        if (--n == 0u) { capture_stop(); return false; }
    }
    *ticks = timebase_ticks() - t0;   /* unsigned: wrap-safe             */
    capture_stop();
    return true;
}

/* Returns true if the process run delivered every half with no overrun. */
static bool sweep_row(uint32_t period, uint32_t halves)
{
    uint32_t ov[3], ticks[3] = { 0, 0, 0 };
    bool     ok[3];
    uint32_t late = 0, missed = 0;
    for (int l = 0; l < 3; l++) {
        ok[l] = sweep_point(period, halves, (enum sweep_load)l, &ticks[l]);
        ov[l] = dma_overrun;
        if (l == SWEEP_PROCESS) { late = late_service; missed = proc_missed; }
    }
    /* Measured rate of the idle run. */
    const uint32_t meas_ksps = ok[0] ? timebase_ksps(halves * SAMPLES_PER_HALF, ticks[0]) : 0u;
    /* Longest line: 150 characters plus NUL; every number is at most
     * 10 digits, "STOPPED" is shorter. */
    char line[176];
    char *p = copy_str(line, "period ");      p = u32_to_str(p, period);
    p = copy_str(p, " (reg ");                p = u32_to_str(p, capture_period());
    p = copy_str(p, ")  ksps nominal ");      p = u32_to_str(p, capture_nominal_ksps(period));
    p = copy_str(p, " measured ");            p = u32_to_str(p, meas_ksps);
    p = copy_str(p, "  overrun idle/process/sfr ");
    for (int l = 0; l < 3; l++) {
        if (l) { *p++ = '/'; }
        p = ok[l] ? u32_to_str(p, ov[l]) : copy_str(p, "STOPPED");
    }
    p = copy_str(p, "  late ");               p = u32_to_str(p, late);
    p = copy_str(p, "  missed ");             p = u32_to_str(p, missed);
    copy_str(p, "\r\n");
    console_puts(line);               /* blocking: works from main() too */
    return ok[SWEEP_PROCESS] && (ov[SWEEP_PROCESS] == 0u) && (missed == 0u) && (late == 0u);
}

/* The sweep itself, callable from the command and from main() (the
 * automatic run after the self-test, AUTO_SWEEP in board.h). Output goes
 * through the blocking console_puts(), not the parser's sink, so it
 * does not depend on the receive path - which is one of the things
 * the automatic run is there to investigate. */
void console_sweep(uint32_t halves, bool choose)
{
    uint32_t count = 0;
    const uint32_t *periods    = capture_sweep_periods(&count);   /* slowest first */
    const uint32_t keep_period = capture_period();
    const bool     was_running = capture_running();

