MicrochipTech/dspic33a-high-speed-adc-example/cli.c
    console_kv("[sweep] halves per point", halves);
    console_puts("[sweep] pacing: ");
    console_puts(capture_pacing_name());
    console_puts("\r\n"
                 "[sweep] idle = CPU polls RAM only, process = main-loop processing, sfr = CPU polls an SFR\r\n"
                 "[sweep] overrun must be 0 for a usable rate; late/missed are from the process run\r\n"
                 "[sweep] nominal = the rate the period should give, measured = samples per second the DMA\r\n"
                 "[sweep] delivered (Timer1), reg = the period read back from the hardware\r\n");

    /* Time base check: 100 ms of CPU time (200 MHz) must be 1 250 000
     * ticks. Anything else and the measured rates are off by the same
     * factor - and the assumption about the timer's clock is wrong. */
    console_kv("[sweep] timer check, ticks per 100 ms (expect 1250000)", timebase_check());
    uint32_t best = 0u, best_ksps = 0u;   /* fastest clean row          */
    for (uint32_t i = 0; i < count; i++) {
        console_puts("[sweep] ");
        if (sweep_row(periods[i], halves) && (periods[i] != 0u) &&
            (capture_nominal_ksps(periods[i]) > best_ksps)) {
            best = periods[i]; best_ksps = capture_nominal_ksps(periods[i]);
        }
    }
    /* Second pass, if the source has one (clock divider: the fractional
     * ratios, the rates the even ones cannot reach). */
    {
        uint32_t count2 = 0;
        const uint32_t *periods2 = capture_sweep_periods2(&count2);
        if (count2 != 0u) {
            console_puts("[sweep] second pass: fractional divider ratios (period = ratio x 100)\r\n");
            for (uint32_t i = 0; i < count2; i++) {
                console_puts("[sweep] ");
                if (sweep_row(periods2[i], halves) && (periods2[i] != 0u) &&
                    (capture_nominal_ksps(periods2[i]) > best_ksps)) {
                    best = periods2[i]; best_ksps = capture_nominal_ksps(periods2[i]);
                }
            }
        }
    }

    /* The question the sweep answers: the highest rate at which the CPU
     * gets every half (missed 0) and the DMA every sample (overrun 0),
     * with the main-loop processing running. At boot that rate is what
     * the measurement then runs at; a rate with overruns would also
     * raise the DMA interrupt for every lost sample (1.6 million per
     * second at 40 MSPS on the board) and starve the console. */
    if (choose && (best != 0u)) {
        (void)capture_set_period(best);
        console_kv("[sweep] using period", best);
        console_kv("[sweep]   ksps nominal", capture_nominal_ksps(best));
        console_puts("[sweep]   the highest rate with overrun 0 and missed 0 in the process run\r\n");
    } else if (choose && (keep_period != 0u)) {
        (void)capture_set_period(keep_period);
        console_kv("[sweep] NO CLEAN RATE - every row lost samples or halves; keeping period", keep_period);
    } else {
        if (keep_period != 0u) { (void)capture_set_period(keep_period); }
    }
    counters_clear();
    if (was_running) { capture_start(); }
    console_puts(choose ? "[sweep] done: counters cleared\r\n"
                        : "[sweep] done: counters cleared, previous period and run state restored\r\n");
}

static void cmd_sweep_fn(int argc, char **argv)
{
    uint32_t halves = SWEEP_HALVES_DEFAULT;
    if ((argc > 2) || ((argc == 2) && !arg_u32(argv[1], 10u, 100000u, &halves))) {
        usage("sweep [halves per point 10..100000, default 2000]");
        return;
    }
    console_sweep(halves, false);
}
CMD_DEFINE(sweep, "sweep", cmd_sweep_fn, "sweep [halves] - overrun vs sample rate for the active pacing");

static void cmd_period_fn(int argc, char **argv)
{
    uint32_t v;
    if ((argc != 2) || !arg_u32(argv[1], 2u, 65535u, &v)) {
        usage("period <n>  (sample period in the active pacing's unit: SCCP1 trigger 2..65535 x 10 ns, clock divider 100..1000 = ratio x 100, repeat timer 2..63 TAD)");
        return;
    }
    if (!capture_set_period(v)) {
        put_line("period: out of range for the active pacing, or back-to-back (no period)");
        cmd_parser_fail();
        return;
    }
    put_kv("period", v);
    put_kv("ksps nominal", capture_nominal_ksps(v));
}
CMD_DEFINE(period, "period", cmd_period_fn, "period <n> - sample period in the active pacing's unit");

static void cmd_pacing_fn(int argc, char **argv)
{
    uint32_t v;
    if ((argc != 2) || !arg_u32(argv[1], 0u, 65u, &v) || !capture_set_pacing((uint8_t)v)) {
        usage("pacing <65|64|3|34|2>  (65 = one conversion per SCCP1 trigger, 64 = ADC clock divider, 3 = ADC repeat timer, 34 = SCCP1 as burst trigger, 2 = back-to-back)");
        return;
    }
    put_kv("pacing", v);
    put_line(capture_pacing_name());
    put_kv("period", capture_period());
}
CMD_DEFINE(pacing, "pacing", cmd_pacing_fn, "pacing <65|64|3|34|2> - what paces the conversions");

static void cmd_reset_fn(int argc, char **argv)
{
    (void)argc; (void)argv;
    put_line("resetting");
    console_drain();                    /* let the reply leave first */
    __asm__ volatile ("reset");
}
CMD_DEFINE(reset, "reset", cmd_reset_fn, "reset - software reset");

/* ------------------------------------------------------------------ */
void cli_init(void)
{
    /* The clocks have changed under the baud generator: re-set it for
     * the 100 MHz peripheral clock, after the last FRC-timed byte is out.
     * Only when the divider really changes: in the simulator build the
     * CPU never leaves the FRC, and toggling ON while the simulator's
     * UART model is still transmitting leaves its transmitter dead
     * (TXWRE set, nothing gets out any more). */
    if (U2BRG != UART_BRG_PLL) {
        console_drain();
        uart2_setup(UART_BRG_PLL);
        console_trace("[boot] uart reclocked to PLL2, 115200 8N1\r\n");
    }

    cmd_parser_init(console_write);
    cmd_parser_set_yield(console_yield);     /* after init - init clears it */
    (void)cmd_register(&cmd_version);
    (void)cmd_register(&cmd_status);
    (void)cmd_register(&cmd_regs);
    (void)cmd_register(&cmd_start);
    (void)cmd_register(&cmd_stop);
    (void)cmd_register(&cmd_samc);
    (void)cmd_register(&cmd_input);
    (void)cmd_register(&cmd_selftest);
    (void)cmd_register(&cmd_stats);
    (void)cmd_register(&cmd_dump);
    (void)cmd_register(&cmd_clear);
    (void)cmd_register(&cmd_led);
    (void)cmd_register(&cmd_sweep);
    (void)cmd_register(&cmd_period);
    (void)cmd_register(&cmd_pacing);
    (void)cmd_register(&cmd_core);
    (void)cmd_register(&cmd_dac);
    (void)cmd_register(&cmd_dactest);
    (void)cmd_register(&cmd_reset);

    /* Banner, once at start-up. A human sees what is talking and which
     * build it is; a script simply reads on until the readiness byte that
     * follows the first prompt. */
    console_puts("\r\n"
                 "adc_dma_40msps - ADC at 40 MSPS into RAM via DMA\r\n"
                 SIM_BANNER_NOTE           /* empty on silicon            */
                 "board: EV74H48A, dsPIC33AK512MPS512 GP DIM\r\n"
                 "build: " BUILD_ID "\r\n"
                 "type 'help' for the commands\r\n"
                 "please log this terminal from power-up and send it back\r\n");

    /* Receive interrupt: IRQ 102, IEC3/IFS3 bit 6, priority in IPC12.
     * Enabled last, so that nothing typed early runs a command before
     * the measurement is set up. */
    IPC12bits.U2RXIP = UART_RX_PRIORITY;
    IFS3bits.U2RXIF  = 0u;
    IEC3bits.U2RXIE  = 1u;

    cmd_parser_prompt();                     /* sync point for a reader */
}
